tinyNozzle/2D/6_with2outlets_cyclic_short_3.27Exit_5Deg (CURRENT 5 DEG)/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.034e6;


boundaryField
{
	wall
	{
		type		zeroGradient;
	}

    	outlet
    	{

        	type            waveTransmissive;
        	field           p;
        	psi             thermo:psi;
        	gamma           1.67;
        	fieldInf        0.0000001;
        	lInf            1e-04;
        	value           uniform 0.0000001;
    	}
	inlet
    	{
        	type            totalPressure;
        	rho             none;
        	psi             thermo:psi;
        	gamma           1.67;
        	p0              uniform 1.034e6;
        	value           uniform 1.034e6;
    	}		
	
	front
	{
		type		wedge;
	}
    	back
    	{
        	type            wedge;
    	}
}


// ************************************************************************* //

        	type            waveTransmissive;
        	field           p;
        	psi             thermo:psi;
        	gamma           1.67;
        	fieldInf        0.0000001;
        	lInf            1;
        	value           uniform 0.0000001;