tinyNozzle/2D/6_with2outlets_cyclic_short_3.27Exit_5Deg (CURRENT 5 DEG)/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            wedge;
        nFaces          56928;
        startFace       112622;
    }
    back
    {
        type            wedge;
        nFaces          56928;
        startFace       169550;
    }
    inlet
    {
        type            patch;
        nFaces          48;
        startFace       226478;
    }
    outlet
    {
        type            patch;
        nFaces          48;
        startFace       226526;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1186;
        startFace       226574;
    }
)

// ************************************************************************* //
